Revit 2024 API
PointCloudColorSettings Constructor
 Constructs color settings object with default colors.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public PointCloudColorSettings()
Visual Basic
Public Sub New
Visual C++
public:
PointCloudColorSettings()
See Also
PointCloudColorSettings Class
PointCloudColorSettings Overload
Autodesk.Revit.DB.PointClouds Namespace